NMMI/SoftHandPRO-and-Generic-FW-PSoC5/Generic.cydsn/codegentemp/Chip_Select_ENCODER_LINE.h
/*******************************************************************************
* File Name: Chip_Select_ENCODER_LINE.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_Chip_Select_ENCODER_LINE_H) /* CY_CONTROL_REG_Chip_Select_ENCODER_LINE_H */
#define CY_CONTROL_REG_Chip_Select_ENCODER_LINE_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} Chip_Select_ENCODER_LINE_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    Chip_Select_ENCODER_LINE_Write(uint8 control) ;
uint8   Chip_Select_ENCODER_LINE_Read(void) ;

void Chip_Select_ENCODER_LINE_SaveConfig(void) ;
void Chip_Select_ENCODER_LINE_RestoreConfig(void) ;
void Chip_Select_ENCODER_LINE_Sleep(void) ; 
void Chip_Select_ENCODER_LINE_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define Chip_Select_ENCODER_LINE_Control        (* (reg8 *) Chip_Select_ENCODER_LINE_Sync_ctrl_reg__CONTROL_REG )
#define Chip_Select_ENCODER_LINE_Control_PTR    (  (reg8 *) Chip_Select_ENCODER_LINE_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_Chip_Select_ENCODER_LINE_H */


/* [] END OF FILE */
